---
kind: enumMember
id: F:Autodesk.Revit.DB.Macros.ModuleStatus.Corrupt
enum: Autodesk.Revit.DB.Macros.ModuleStatus
source: html/96f00239-87a1-eb58-3433-1d5f804c3a4d.htm
---
# Autodesk.Revit.DB.Macros.ModuleStatus.Corrupt

The module is corrupt.